#### Terraform Format and Style 🖌`success`
#### Terraform Security Scan 🔒`success`

#### tfsec Security Scan 🔒

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:512

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:495

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:330

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:313

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:211

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:194

- **AVD-AWS-0104**: Security group rule allows egress to multiple public internet addresses.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/node_groups.tf:247

- **AVD-AWS-0105**: Network ACL rule allows ingress from public internet.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:496

- **AVD-AWS-0105**: Network ACL rule allows ingress from public internet.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:314

- **AVD-AWS-0105**: Network ACL rule allows ingress from public internet.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:195

- **AVD-AWS-0178**: VPC Flow Logs is not enabled for VPC 
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:28

- **AVD-AWS-0031**: Repository tags are mutable.
  - Severity: HIGH
  - Location: /github/workspace/modules/ecr/main.tf:20

- **AVD-AWS-0033**: Repository is not encrypted using KMS.
  - Severity: LOW
  - Location: /github/workspace/modules/ecr/main.tf:18

- **AVD-AWS-0038**: Control plane controller manager logging is not enabled.
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/main.tf:35

- **AVD-AWS-0038**: Control plane scheduler logging is not enabled.
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/main.tf:35

- **AVD-AWS-0040**: Public cluster access is enabled.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/main.tf:69

- **AVD-AWS-0041**: Cluster allows access from a public CIDR: 0.0.0.0/0.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/main.tf:70

- **AVD-AWS-0123**: Multi-Factor authentication is not enforced for group
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-iam?ref=416c5ccda8807632b505888d55ca83c3b71282a8/modules/iam-group-with-policies/main.tf:5

- **AVD-AWS-0123**: Multi-Factor authentication is not enforced for group
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-iam?ref=416c5ccda8807632b505888d55ca83c3b71282a8/modules/iam-group-with-policies/main.tf:5

- **AVD-AWS-0123**: Multi-Factor authentication is not enforced for group
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-iam?ref=416c5ccda8807632b505888d55ca83c3b71282a8/modules/iam-group-with-assumable-roles-policy/main.tf:18

- **AVD-AWS-0123**: Multi-Factor authentication is not enforced for group
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-iam?ref=416c5ccda8807632b505888d55ca83c3b71282a8/modules/iam-group-with-assumable-roles-policy/main.tf:18

- **AVD-AWS-0066**: Function does not have tracing enabled.
  - Severity: LOW
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-lambda?ref=e2500c0d4698bc81801ecf18c2cfa41d6bf8e087/main.tf:24

- **AVD-AWS-0177**: Instance does not have Deletion Protection enabled
  - Severity: MEDIUM
  - Location: /git::https:/github.com/terraform-aws-modules/terraform-aws-rds?ref=22b02b391e1164cc1805e8f27eb4e3a5bd79bb95/modules/db_instance/main.tf:113

- **AVD-AWS-0077**: Instance has very low backup retention period.
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-rds?ref=22b02b391e1164cc1805e8f27eb4e3a5bd79bb95/modules/db_instance/main.tf:101

- **AVD-AWS-0088**: Bucket does not have encryption enabled
  - Severity: HIGH
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-s3-bucket?ref=1eb6a5766e0a84168d6e8aed2ccfa83e667a9561/main.tf:25

- **AVD-AWS-0089**: Bucket does not have logging enabled
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-s3-bucket?ref=1eb6a5766e0a84168d6e8aed2ccfa83e667a9561/main.tf:25

- **AVD-AWS-0132**: Bucket does not encrypt data with a customer managed key.
  - Severity: HIGH
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-s3-bucket?ref=1eb6a5766e0a84168d6e8aed2ccfa83e667a9561/main.tf:25


#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.
```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[0m[1mmodule.rds.module.secret_manager.module.secrets_manager.random_password.this[0]: Refreshing state... [id=none][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.external.archive_prepare[0]: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.local_file.archive_plan[0]: Refreshing state... [id=f3dc4078712aed4046102d0ddc460a123c152665][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.null_resource.archive[0]: Refreshing state... [id=1107290844236829803][0m
[0m[1mmodule.ecr.aws_ecr_repository.this: Refreshing state... [id=dex-backend][0m
[0m[1mmodule.rds.module.secret_manager.module.secrets_manager.aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-rds-sec-mgr20250521174919846200000002-EqfMkZ][0m
[0m[1mmodule.s3.module.s3_bucket[0].aws_s3_bucket.this[0]: Refreshing state... [id=dex-backend-us-east-1-terraform-state-bucket][0m
[0m[1mmodule.amplify.data.aws_ssm_parameter.github_pat["angularuiform"]: Reading...[0m[0m
[0m[1mmodule.iam.module.eks_cluster_role.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.amplify.data.aws_ssm_parameter.github_pat["popupuibackend"]: Reading...[0m[0m
[0m[1mmodule.rds.module.secret_manager.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.iam.module.eks_cluster_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3943213819][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/dex-backend-us-east-1-rds-lambda-secret-rotation][0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/dex-backend-us-east-1-eks/cluster][0m
[0m[1mmodule.rds.module.secret_manager.data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_canonical_user_id.this[0]: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.artifact.aws_kms_key.this: Refreshing state... [id=5695f7f2-b256-46dc-9816-e79e27c0ad22][0m
[0m[1mmodule.rds.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_availability_zones.available: Reading...[0m[0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_canonical_user_id.this[0]: Read complete after 0s [id=51df51ce4795b766a64b750146ef4984882d8c51d697bc0e57e962a1d274c4a3][0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.rds.aws_iam_role.rds_monitoring_role: Refreshing state... [id=rds-monitoring-role][0m
[0m[1mmodule.rds.data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.ecr.aws_ecr_registry_scanning_configuration.this: Refreshing state... [id=986323537898][0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.amplify.data.aws_ssm_parameter.github_pat["angularuiform"]: Read complete after 0s [id=/amplify/public][0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.amplify.data.aws_ssm_parameter.github_pat["popupuibackend"]: Read complete after 0s [id=/amplify/public][0m
[0m[1mmodule.eks.module.eks.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799][0m
[0m[1mmodule.iam.module.user_developers[2].aws_iam_user.this[0]: Refreshing state... [id=lekan][0m
[0m[1mmodule.eks.module.eks.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.iam.module.user_developers[0].aws_iam_user.this[0]: Refreshing state... [id=samuel][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.iam.module.user_developers[1].aws_iam_user.this[0]: Refreshing state... [id=peter][0m
[0m[1mmodule.iam.module.user_devops[2].aws_iam_user.this[0]: Refreshing state... [id=saul][0m
[0m[1mmodule.eks.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296][0m
[0m[1mmodule.iam.module.user_devops[0].aws_iam_user.this[0]: Refreshing state... [id=sammy][0m
[0m[1mmodule.iam.module.user_devops[1].aws_iam_user.this[0]: Refreshing state... [id=joseph][0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.ecr.aws_ecr_account_setting.registry_policy_scope: Refreshing state... [name=REGISTRY_POLICY_SCOPE][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.iam.module.eks_cluster_role.aws_iam_role.this[0]: Refreshing state... [id=AmazonEKSClusterRole][0m
[0m[1mdata.aws_availability_zones.available: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.rds.module.secret_manager.module.secrets_manager.aws_secretsmanager_secret_version.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-rds-sec-mgr20250521174919846200000002-EqfMkZ|terraform-20250521174920163900000006][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.ecr.aws_ecr_lifecycle_policy.this: Refreshing state... [id=dex-backend][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.aws_iam_role.lambda[0]: Refreshing state... [id=dex-backend-us-east-1-rds-lambda-secret-rotation][0m
[0m[1mmodule.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0942df3048e39f7e9][0m
[0m[1mmodule.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=dex-backend-us-east-1-eks-cluster-20250521174919846200000001][0m
[0m[1mmodule.eks.module.eks.data.aws_iam_session_context.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_iam_role.this[0]: Refreshing state... [id=default_node_group-eks-node-group-20250521174919847500000004][0m
[0m[1mmodule.artifact.aws_codeartifact_domain.this: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend][0m
[0m[1mmodule.iam.module.user_developers[0].aws_iam_user_login_profile.this[0]: Refreshing state... [id=samuel][0m
[0m[1mmodule.eks.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::986323537898:assumed-role/openid-gha-role/GitHubActions][0m
[0m[1mmodule.iam.module.user_developers[1].aws_iam_user_login_profile.this[0]: Refreshing state... [id=peter][0m
[0m[1mmodule.iam.module.user_developers[2].aws_iam_user_login_profile.this[0]: Refreshing state... [id=lekan][0m
[0m[1mmodule.iam.module.user_developers[1].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VLZDVXJ55][0m
[0m[1mmodule.iam.module.user_developers[2].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VL23WCP4L][0m
[0m[1mmodule.iam.module.user_developers[0].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VHSH475N7][0m
[0m[1mmodule.rds.module.secret_manager.module.secrets_manager.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.rds.module.secret_manager.module.secrets_manager.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4216717818][0m
[0m[1mmodule.iam.module.user_devops[2].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VEMEEGXHT][0m
[0m[1mmodule.iam.module.user_devops[0].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VAZ44SIMX][0m
[0m[1mmodule.iam.module.user_devops[1].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VDDGKY5IM][0m
[0m[1mmodule.iam.module.user_devops[2].aws_iam_user_login_profile.this[0]: Refreshing state... [id=saul][0m
[0m[1mmodule.iam.module.user_devops[0].aws_iam_user_login_profile.this[0]: Refreshing state... [id=sammy][0m
[0m[1mmodule.iam.module.user_devops[1].aws_iam_user_login_profile.this[0]: Refreshing state... [id=joseph][0m
[0m[1mmodule.eks.module.eks.data.aws_iam_policy_document.custom[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117][0m
[0m[1mmodule.rds.aws_iam_role_policy_attachment.rds_monitoring_policy: Refreshing state... [id=rds-monitoring-role-20250523154140499800000001][0m
[0m[1mmodule.iam.module.eks_cluster_role.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=AmazonEKSClusterRole-2025051412141516790000000a][0m
[0m[1mmodule.s3.module.s3_bucket[0].aws_s3_bucket_versioning.this[0]: Refreshing state... [id=dex-backend-us-east-1-terraform-state-bucket][0m
[0m[1mmodule.s3.module.s3_bucket[0].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=dex-backend-us-east-1-terraform-state-bucket][0m
[0m[1mmodule.rds.module.secret_manager.module.secrets_manager.aws_secretsmanager_secret_policy.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-rds-sec-mgr20250521174919846200000002-EqfMkZ][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_iam_policy_document.logs[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::986323537898:policy/dex-backend-us-east-1-eks-cluster-20250521174919980000000005][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2669685264][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default_node_group-eks-node-group-20250521174919847500000004-2025052117492042030000000c][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default_node_group-eks-node-group-20250521174919847500000004-2025052117492047790000000d][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default_node_group-eks-node-group-20250521174919847500000004-2025052117492050430000000f][0m
[0m[1mmodule.rds.module.lambda_rds.data.aws_iam_policy_document.this: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.data.aws_iam_policy_document.this: Read complete after 0s [id=1169781387][0m
[0m[1mmodule.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=dex-backend-us-east-1-eks-cluster-20250521174919846200000001-2025052117492041910000000b][0m
[0m[1mmodule.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=dex-backend-us-east-1-eks-cluster-20250521174919846200000001-20250521174920339800000009][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::986323537898:policy/dex-backend-us-east-1-rds-lambda-secret-rotation-logs][0m
[0m[1mmodule.s3.module.s3_bucket[0].aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=dex-backend-us-east-1-terraform-state-bucket][0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2164679625][0m
[0m[1mmodule.artifact.data.aws_iam_policy_document.artifactPolicy: Reading...[0m[0m
[0m[1mmodule.artifact.data.aws_iam_policy_document.artifactPolicy: Read complete after 0s [id=908611171][0m
[0m[1mmodule.artifact.data.aws_codeartifact_authorization_token.this: Reading...[0m[0m
[0m[1mmodule.artifact.aws_codeartifact_repository.this["maven"]: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-maven][0m
[0m[1mmodule.artifact.aws_codeartifact_repository.this["npm"]: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-npm][0m
[0m[1mmodule.artifact.aws_codeartifact_repository.this["pypi"]: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-pypi][0m
[0m[1mmodule.eks.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=dfc8e4aa-88ce-4d46-a1d3-73a4625a3a83][0m
[0m[1mmodule.artifact.aws_codeartifact_domain_permissions_policy.test: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend][0m
[0m[1mmodule.network.data.aws_availability_zones.available: Reading...[0m[0m
[0m[1mmodule.artifact.data.aws_codeartifact_authorization_token.this: Read complete after 0s [id=986323537898:dex-backend][0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.rds.aws_secretsmanager_secret_version.rds_secret_version_update["db"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-rds-sec-mgr20250521174919846200000002-EqfMkZ|terraform-20250521174920558600000010][0m
[0m[1mmodule.rds.aws_secretsmanager_secret_version.rds_secret_version_update["test"]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-rds-sec-mgr20250521174919846200000002-EqfMkZ|terraform-20250521174920563600000011][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::986323537898:policy/dex-backend-us-east-1-rds-lambda-secret-rotation][0m
[0m[1mmodule.eks.module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=dex-backend-us-east-1-eks-cluster-20250521174919846200000001-2025052117492050400000000e][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=dex-backend-us-east-1-rds-lambda-secret-rotation-20250521174920568200000012][0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.aws_iam_group.this: Refreshing state... [id=developers-with_assumed_roles][0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.data.aws_iam_policy_document.assume_role: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2993689567][0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_group.this[0]: Refreshing state... [id=developers][0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_caller_identity.current[0]: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.s3.module.s3_bucket[0].aws_s3_bucket_acl.this[0]: Refreshing state... [id=dex-backend-us-east-1-terraform-state-bucket,private][0m
[0m[1mmodule.eks.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/dex-backend-us-east-1-eks][0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_group.this[0]: Refreshing state... [id=devops][0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::986323537898:policy/developers-with_assumed_roles][0m
[0m[1mmodule.network.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.aws_iam_group.this: Refreshing state... [id=devops-with_AssumedRoles][0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_caller_identity.current[0]: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.data.aws_iam_policy_document.assume_role: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2993689567][0m
[0m[1mmodule.eks.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::986323537898:policy/dex-backend-us-east-1-eks-cluster-ClusterEncryption2025052117494219500000001c][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::986323537898:policy/devops-with_AssumedRoles][0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.aws_iam_group_membership.this[0]: Refreshing state... [id=developers-with_assumed_roles][0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_iam_policy_document.iam_self_management: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=dex-backend-us-east-1-rds-lambda-secret-rotation-20250521174920862300000013][0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_iam_policy_document.iam_self_management: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=571272153][0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_group_membership.this[0]: Refreshing state... [id=developers][0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=571272153][0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_group_policy_attachment.custom_arns[0]: Refreshing state... [id=developers-20250514121416108100000011][0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_policy.iam_self_management[0]: Refreshing state... [id=arn:aws:iam::986323537898:policy/IAMSelfManagement-2025051412141543250000000c][0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_policy.iam_self_management[0]: Refreshing state... [id=arn:aws:iam::986323537898:policy/IAMSelfManagement-2025051412141518750000000b][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.aws_iam_group_membership.this[0]: Refreshing state... [id=devops-with_AssumedRoles][0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_group_policy_attachment.custom_arns[0]: Refreshing state... [id=devops-2025051412141576850000000d][0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_group_membership.this[0]: Refreshing state... [id=devops][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.aws_lambda_function.this[0]: Refreshing state... [id=dex-backend-us-east-1-rds-lambda-secret-rotation][0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.aws_iam_group_policy_attachment.this: Refreshing state... [id=developers-with_assumed_roles-20250514121416024000000010][0m
[0m[1mmodule.eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=dex-backend-us-east-1-eks-cluster-20250521174919846200000001-2025052117494249570000001d][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.aws_iam_group_policy_attachment.this: Refreshing state... [id=devops-with_AssumedRoles-2025051412141578880000000e][0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_group_policy_attachment.iam_self_management[0]: Refreshing state... [id=developers-20250514121416110500000012][0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_group_policy_attachment.iam_self_management[0]: Refreshing state... [id=devops-2025051412141588260000000f][0m
[0m[1mmodule.network.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0edba88209af8d4ec][0m
[0m[1mmodule.network.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-08ea92d9dd995ca89][0m
[0m[1mmodule.network.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d0da2d9092274a56][0m
[0m[1mmodule.network.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08c7299bacbda65d4][0m
[0m[1mmodule.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f328b0a46a53029a][0m
[0m[1mmodule.network.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0c0a69a30f4a10478][0m
[0m[1mmodule.network.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-07d8f3b98032f229d][0m
[0m[1mmodule.network.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07d015da787f9a669][0m
[0m[1mmodule.network.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06b541ff1b636a724][0m
[0m[1mmodule.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-071fec278a5cf994a][0m
[0m[1mmodule.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a0927fadad706792][0m
[0m[1mmodule.network.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-098c7ee60fb5386f5][0m
[0m[1mmodule.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0f240e396faa0a9a0][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.aws_lambda_permission.current_version_triggers["secrets"]: Refreshing state... [id=secrets][0m
[0m[1mmodule.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-07a0cb356c129f515][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.aws_lambda_permission.unqualified_alias_triggers["secrets"]: Refreshing state... [id=secrets][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0ad57dc6d84681da9][0m
[0m[1mmodule.network.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0294d1b67b415cc60][0m
[0m[1mmodule.network.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08c7299bacbda65d41080289494][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-055ab5878ae9ac67c][0m
[0m[1mmodule.network.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=dex-backend-us-east-1-vpc][0m
[0m[1mmodule.rds.module.rds_sg.module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-00a8f80582e9dfe97][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06706bfaaa9e8972a][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-061dab8173f814302][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cf4666acc2915074][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-065ef437d8da1dfce][0m
[0m[1mmodule.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-test-rds-secret20250521174935467900000016-rozutw][0m
[0m[1mmodule.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-db-rds-secret20250521174935468000000018-OmsWxw][0m
[0m[1mmodule.rds.module.rds_sg.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-123818434][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3388677669][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-12155315][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2000975449][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2890591047][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2819341997][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-333792658][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1521403332][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3205181168][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2695199901][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-135612584][0m
[0m[1mmodule.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1961854162][0m
[0m[1mmodule.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.aws_secretsmanager_secret_policy.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-test-rds-secret20250521174935467900000016-rozutw][0m
[0m[1mmodule.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.aws_secretsmanager_secret_policy.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-db-rds-secret20250521174935468000000018-OmsWxw][0m
[0m[1mmodule.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-db-rds-secret20250521174935468000000018-OmsWxw][0m
[0m[1mmodule.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-test-rds-secret20250521174935467900000016-rozutw][0m
[0m[1mmodule.s3.module.s3_bucket[0].aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=dex-backend-us-east-1-terraform-state-bucket][0m
[0m[1mmodule.network.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-080a619c1f7db35b5][0m
[0m[1mmodule.rds.module.master[1].module.db_instance.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.rds.module.master[1].module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.rds.module.master[0].module.db_instance.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.rds.module.master[0].module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.rds.module.master[1].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...[0m[0m
[0m[1mmodule.rds.module.master[0].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...[0m[0m
[0m[1mmodule.rds.module.master[1].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537][0m
[0m[1mmodule.rds.module.master[0].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537][0m
[0m[1mmodule.rds.module.master[1].module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=dex-backend-us-east-1-test-master-20250521174924391500000014][0m
[0m[1mmodule.rds.module.master[1].module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/dex-backend-us-east-1-test-master/upgrade][0m
[0m[1mmodule.rds.module.master[0].module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=dex-backend-us-east-1-db-master-20250521174924391600000015][0m
[0m[1mmodule.rds.module.master[0].module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/dex-backend-us-east-1-db-master/postgresql][0m
[0m[1mmodule.rds.module.master[1].module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/dex-backend-us-east-1-test-master/postgresql][0m
[0m[1mmodule.rds.module.master[0].module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/dex-backend-us-east-1-db-master/upgrade][0m
[0m[1mmodule.network.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f328b0a46a53029a1080289494][0m
[0m[1mmodule.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=dex-backend-us-east-1-eks][0m
[0m[1mmodule.eks.module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=dex-backend-us-east-1-eks:arn:aws:iam::986323537898:role/openid-gha-role][0m
[0m[1mmodule.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0686284bc201850ad,Environment][0m
[0m[1mmodule.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-0686284bc201850ad,Terraform][0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["eks-node-monitoring-agent"]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni][0m
[0m[1mmodule.eks.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-05-21T17:59:57Z][0m
[0m[1mmodule.eks.module.eks.data.tls_certificate.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=3092525467306701545][0m
[0m[1mmodule.rds.module.master[1].module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-CMQRP2BKP2IYZKLSYFEOAQW4QA][0m
[0m[1mmodule.rds.module.master[0].module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-JKPEU7NIEG5POWFH2WPLKRDGFM][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_launch_template.this[0]: Refreshing state... [id=lt-0b789db33a7c30cba][0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["eks-node-monitoring-agent"]: Read complete after 0s [id=eks-node-monitoring-agent][0m
[0m[1mmodule.eks.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7][0m
[0m[1mmodule.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::986323537898:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/11DBD73405A1A3095E6EBED35F8BD32C][0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy][0m
[0m[1mmodule.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=dex-backend-us-east-1-eks#arn:aws:iam::986323537898:role/openid-gha-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_eks_node_group.this[0]: Refreshing state... [id=dex-backend-us-east-1-eks:default_node_group-20250521180003324300000022][0m
[0m[1mmodule.rds.module.replica["db"].module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=dex-backend-us-east-1-db-replica-20250523155945973800000002][0m
[0m[1mmodule.eks.module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 1s [id=eks-pod-identity-agent][0m
[0m[1mmodule.eks.module.eks.aws_eks_addon.before_compute["eks-pod-identity-agent"]: Refreshing state... [id=dex-backend-us-east-1-eks:eks-pod-identity-agent][0m
[0m[1mmodule.eks.module.eks.aws_eks_addon.this["eks-node-monitoring-agent"]: Refreshing state... [id=dex-backend-us-east-1-eks:eks-node-monitoring-agent][0m
[0m[1mmodule.eks.module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=dex-backend-us-east-1-eks:coredns][0m
[0m[1mmodule.eks.module.eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=dex-backend-us-east-1-eks:vpc-cni][0m
[0m[1mmodule.eks.module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=dex-backend-us-east-1-eks:kube-proxy][0m
[0m[1mmodule.eks.data.aws_eks_cluster_auth.cluster: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=dex-backend-us-east-1-eks][0m
[0m[1mmodule.eks.data.aws_iam_openid_connect_provider.oidc_provider: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_openid_connect_provider.oidc_provider: Read complete after 0s [id=arn:aws:iam::986323537898:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/11DBD73405A1A3095E6EBED35F8BD32C][0m
[0m[1mmodule.eks.module.eks-auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth][0m
[0m[1mmodule.eks.helm_release.argocd: Refreshing state... [id=argocd][0m
[0m[1mmodule.eks.helm_release.cert_manager: Refreshing state... [id=cert-manager][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
[32m+[0m/[31m-[0m create replacement and then destroy[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.amplify.aws_amplify_app.frontend["angularuiform"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_app" "frontend" {
      [32m+[0m[0m access_token      = (sensitive value)
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m build_spec        = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - npm ci
                build:
                  commands:
                    - npm run build
              artifacts:
                baseDirectory: dist/angular-pwa
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
      [32m+[0m[0m custom_headers    = (known after apply)
      [32m+[0m[0m default_domain    = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m name              = "dex-backend-us-east-1-angularuiform"
      [32m+[0m[0m platform          = "WEB"
      [32m+[0m[0m production_branch = (known after apply)
      [32m+[0m[0m repository        = "https://github.com/aws-samples/aws-amplify-angular-sample"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m custom_rule {
          [32m+[0m[0m source = "/<*>"
          [32m+[0m[0m status = "404"
          [32m+[0m[0m target = "/index.html"
        }
      [32m+[0m[0m custom_rule {
          [32m+[0m[0m source = "/api/*"
          [32m+[0m[0m status = "200"
          [32m+[0m[0m target = "/api/index.html"
        }
    }

[1m  # module.amplify.aws_amplify_app.frontend["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_app" "frontend" {
      [32m+[0m[0m access_token      = (sensitive value)
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m build_spec        = <<-EOT
            version: 1
            backend:
              phases:
                build:
                  commands:
                    - '# Execute Amplify CLI with the helper script'
                    - amplifyPush --simple
            frontend:
              phases:
                preBuild:
                  commands:
                    - yarn install
                build:
                  commands:
                    - yarn run build
              artifacts:
                baseDirectory: build
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
            
            test:
              phases:
                preTest:
                  commands:
                    - npm ci
                    - npm install -g pm2
                    - npm install -g wait-on
                    - npm install mocha mochawesome mochawesome-merge mochawesome-report-generator
                    - pm2 start npm -- start
                    - wait-on http://localhost:3000
                test:
                  commands:
                    - 'npx cypress run --reporter mochawesome --reporter-options "reportDir=cypress/report/mochawesome-report,overwrite=false,html=false,json=true,timestamp=mmddyyyy_HHMMss"'
                postTest:
                  commands:
                    - npx mochawesome-merge cypress/report/mochawesome-report/mochawesome*.json > cypress/report/mochawesome.json
                    - pm2 kill
              artifacts:
                baseDirectory: cypress
                configFilePath: '**/mochawesome.json'
                files:
                  - '**/*.png'
                  - '**/*.mp4'
        EOT
      [32m+[0m[0m custom_headers    = (known after apply)
      [32m+[0m[0m default_domain    = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m name              = "dex-backend-us-east-1-popupuibackend"
      [32m+[0m[0m platform          = "WEB"
      [32m+[0m[0m production_branch = (known after apply)
      [32m+[0m[0m repository        = "https://github.com/aws-samples/aws-amplify-react-sample"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m custom_rule {
          [32m+[0m[0m source = "/<*>"
          [32m+[0m[0m status = "404"
          [32m+[0m[0m target = "/index.html"
        }
      [32m+[0m[0m custom_rule {
          [32m+[0m[0m source = "/api/*"
          [32m+[0m[0m status = "200"
          [32m+[0m[0m target = "/api/index.html"
        }
    }

[1m  # module.amplify.aws_amplify_backend_environment.backend["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_backend_environment" "backend" {
      [32m+[0m[0m app_id               = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m deployment_artifacts = (known after apply)
      [32m+[0m[0m environment_name     = "popupuibac"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m stack_name           = (known after apply)
    }

[1m  # module.amplify.aws_amplify_branch.main_branch["angularuiform"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_branch" "main_branch" {
      [32m+[0m[0m app_id               = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m associated_resources = (known after apply)
      [32m+[0m[0m branch_name          = "main"
      [32m+[0m[0m custom_domains       = (known after apply)
      [32m+[0m[0m destination_branch   = (known after apply)
      [32m+[0m[0m display_name         = (known after apply)
      [32m+[0m[0m enable_auto_build    = true
      [32m+[0m[0m framework            = "Angular"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m source_branch        = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.amplify.aws_amplify_branch.main_branch["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_branch" "main_branch" {
      [32m+[0m[0m app_id               = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m associated_resources = (known after apply)
      [32m+[0m[0m branch_name          = "main"
      [32m+[0m[0m custom_domains       = (known after apply)
      [32m+[0m[0m destination_branch   = (known after apply)
      [32m+[0m[0m display_name         = (known after apply)
      [32m+[0m[0m enable_auto_build    = true
      [32m+[0m[0m framework            = "React"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m source_branch        = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.amplify.aws_amplify_domain_association.domain_association["angularuiform"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_domain_association" "domain_association" {
      [32m+[0m[0m app_id                              = (known after apply)
      [32m+[0m[0m arn                                 = (known after apply)
      [32m+[0m[0m certificate_verification_dns_record = (known after apply)
      [32m+[0m[0m domain_name                         = "awsamplifyapp.com"
      [32m+[0m[0m enable_auto_sub_domain              = false
      [32m+[0m[0m id                                  = (known after apply)
      [32m+[0m[0m wait_for_verification               = false

      [32m+[0m[0m sub_domain {
          [32m+[0m[0m branch_name = "main"
          [32m+[0m[0m dns_record  = (known after apply)
          [32m+[0m[0m prefix      = "main"
          [32m+[0m[0m verified    = (known after apply)
        }
    }

[1m  # module.amplify.aws_amplify_domain_association.domain_association["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_domain_association" "domain_association" {
      [32m+[0m[0m app_id                              = (known after apply)
      [32m+[0m[0m arn                                 = (known after apply)
      [32m+[0m[0m certificate_verification_dns_record = (known after apply)
      [32m+[0m[0m domain_name                         = "awsamplifyapp.com"
      [32m+[0m[0m enable_auto_sub_domain              = false
      [32m+[0m[0m id                                  = (known after apply)
      [32m+[0m[0m wait_for_verification               = false

      [32m+[0m[0m sub_domain {
          [32m+[0m[0m branch_name = "main"
          [32m+[0m[0m dns_record  = (known after apply)
          [32m+[0m[0m prefix      = "main"
          [32m+[0m[0m verified    = (known after apply)
        }
    }

[1m  # module.amplify.aws_amplify_webhook.main["angularuiform"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_webhook" "main" {
      [32m+[0m[0m app_id      = (known after apply)
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m branch_name = "main"
      [32m+[0m[0m description = "triggermaster"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m url         = (known after apply)
    }

[1m  # module.amplify.aws_amplify_webhook.main["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_webhook" "main" {
      [32m+[0m[0m app_id      = (known after apply)
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m branch_name = "main"
      [32m+[0m[0m description = "triggermaster"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m url         = (known after apply)
    }

[1m  # module.artifact.data.aws_codeartifact_repository_endpoint.this["maven"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_codeartifact_repository_endpoint" "this" {
      [32m+[0m[0m domain              = "dex-backend"
      [32m+[0m[0m domain_owner        = (known after apply)
      [32m+[0m[0m format              = "maven"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m repository          = "devpkg-maven"
      [32m+[0m[0m repository_endpoint = (known after apply)
    }

[1m  # module.artifact.data.aws_codeartifact_repository_endpoint.this["npm"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_codeartifact_repository_endpoint" "this" {
      [32m+[0m[0m domain              = "dex-backend"
      [32m+[0m[0m domain_owner        = (known after apply)
      [32m+[0m[0m format              = "npm"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m repository          = "devpkg-npm"
      [32m+[0m[0m repository_endpoint = (known after apply)
    }

[1m  # module.artifact.data.aws_codeartifact_repository_endpoint.this["nuget"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_codeartifact_repository_endpoint" "this" {
      [32m+[0m[0m domain              = "dex-backend"
      [32m+[0m[0m domain_owner        = (known after apply)
      [32m+[0m[0m format              = "nuget"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m repository          = "devpkg-nuget"
      [32m+[0m[0m repository_endpoint = (known after apply)
    }

[1m  # module.artifact.data.aws_codeartifact_repository_endpoint.this["pypi"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_codeartifact_repository_endpoint" "this" {
      [32m+[0m[0m domain              = "dex-backend"
      [32m+[0m[0m domain_owner        = (known after apply)
      [32m+[0m[0m format              = "pypi"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m repository          = "devpkg-pypi"
      [32m+[0m[0m repository_endpoint = (known after apply)
    }

[1m  # module.artifact.data.aws_codeartifact_repository_endpoint.this["rubygems"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_codeartifact_repository_endpoint" "this" {
      [32m+[0m[0m domain              = "dex-backend"
      [32m+[0m[0m domain_owner        = (known after apply)
      [32m+[0m[0m format              = "rubygems"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m repository          = "devpkg-rubygems"
      [32m+[0m[0m repository_endpoint = (known after apply)
    }

[1m  # module.artifact.aws_codeartifact_repository.this["maven"][0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_codeartifact_repository" "this" {
      [33m~[0m[0m administrator_account = "986323537898" -> (known after apply)
      [33m~[0m[0m arn                   = "arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-maven" -> (known after apply)
      [33m~[0m[0m domain_owner          = "986323537898" -> (known after apply)
      [33m~[0m[0m id                    = "arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-maven" -> (known after apply)
        tags                  = {
            "Environment" = "dex-backend"
            "Owner"       = "dex-backend"
            "Terraform"   = "true"
        }
        [90m# (4 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m external_connections {
          [32m+[0m[0m external_connection_name = "public:maven-central"
          [32m+[0m[0m package_format           = (known after apply)
          [32m+[0m[0m status                   = (known after apply)
        }

      [31m-[0m[0m upstream {
          [31m-[0m[0m repository_name = "maven-central-store" [90m-> null[0m[0m
        }
    }

[1m  # module.artifact.aws_codeartifact_repository.this["nuget"][0m will be created
[0m  [32m+[0m[0m resource "aws_codeartifact_repository" "this" {
      [32m+[0m[0m administrator_account = (known after apply)
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m description           = "Code Artifact Repo for dex-backend"
      [32m+[0m[0m domain                = "dex-backend"
      [32m+[0m[0m domain_owner          = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m repository            = "devpkg-nuget"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m external_connections {
          [32m+[0m[0m external_connection_name = "public:nuget"
          [32m+[0m[0m package_format           = (known after apply)
          [32m+[0m[0m status                   = (known after apply)
        }
    }

[1m  # module.artifact.aws_codeartifact_repository.this["rubygems"][0m will be created
[0m  [32m+[0m[0m resource "aws_codeartifact_repository" "this" {
      [32m+[0m[0m administrator_account = (known after apply)
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m description           = "Code Artifact Repo for dex-backend"
      [32m+[0m[0m domain                = "dex-backend"
      [32m+[0m[0m domain_owner          = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m repository            = "devpkg-rubygems"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m external_connections {
          [32m+[0m[0m external_connection_name = "public:rubygems"
          [32m+[0m[0m package_format           = (known after apply)
          [32m+[0m[0m status                   = (known after apply)
        }
    }

[1m  # module.artifact.aws_codeartifact_repository_permissions_policy.this["maven"][0m will be created
[0m  [32m+[0m[0m resource "aws_codeartifact_repository_permissions_policy" "this" {
      [32m+[0m[0m domain          = "dex-backend"
      [32m+[0m[0m domain_owner    = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m policy_document = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "codeartifact:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = "*"
                      [32m+[0m[0m Resource  = "arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_revision = (known after apply)
      [32m+[0m[0m repository      = "devpkg-maven"
      [32m+[0m[0m resource_arn    = (known after apply)
    }

[1m  # module.artifact.aws_codeartifact_repository_permissions_policy.this["npm"][0m will be created
[0m  [32m+[0m[0m resource "aws_codeartifact_repository_permissions_policy" "this" {
      [32m+[0m[0m domain          = "dex-backend"
      [32m+[0m[0m domain_owner    = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m policy_document = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "codeartifact:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = "*"
                      [32m+[0m[0m Resource  = "arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_revision = (known after apply)
      [32m+[0m[0m repository      = "devpkg-npm"
      [32m+[0m[0m resource_arn    = (known after apply)
    }

[1m  # module.artifact.aws_codeartifact_repository_permissions_policy.this["nuget"][0m will be created
[0m  [32m+[0m[0m resource "aws_codeartifact_repository_permissions_policy" "this" {
      [32m+[0m[0m domain          = "dex-backend"
      [32m+[0m[0m domain_owner    = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m policy_document = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "codeartifact:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = "*"
                      [32m+[0m[0m Resource  = "arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_revision = (known after apply)
      [32m+[0m[0m repository      = "devpkg-nuget"
      [32m+[0m[0m resource_arn    = (known after apply)
    }

[1m  # module.artifact.aws_codeartifact_repository_permissions_policy.this["pypi"][0m will be created
[0m  [32m+[0m[0m resource "aws_codeartifact_repository_permissions_policy" "this" {
      [32m+[0m[0m domain          = "dex-backend"
      [32m+[0m[0m domain_owner    = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m policy_document = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "codeartifact:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = "*"
                      [32m+[0m[0m Resource  = "arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_revision = (known after apply)
      [32m+[0m[0m repository      = "devpkg-pypi"
      [32m+[0m[0m resource_arn    = (known after apply)
    }

[1m  # module.artifact.aws_codeartifact_repository_permissions_policy.this["rubygems"][0m will be created
[0m  [32m+[0m[0m resource "aws_codeartifact_repository_permissions_policy" "this" {
      [32m+[0m[0m domain          = "dex-backend"
      [32m+[0m[0m domain_owner    = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m policy_document = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "codeartifact:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = "*"
                      [32m+[0m[0m Resource  = "arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_revision = (known after apply)
      [32m+[0m[0m repository      = "devpkg-rubygems"
      [32m+[0m[0m resource_arn    = (known after apply)
    }

[1m  # module.artifact.time_sleep.wait_for_external_connections[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "wait_for_external_connections" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.ecr.aws_ecr_repository.this[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ecr_repository" "this" {
        id                   = "dex-backend"
        name                 = "dex-backend"
        tags                 = {}
      [33m~[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
        [90m# (4 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.rds.data.aws_secretsmanager_secret_version.rds_secret_version[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_secretsmanager_secret_version" "rds_secret_version" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m created_date   = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m secret_binary  = (sensitive value)
      [32m+[0m[0m secret_id      = "arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-rds-sec-mgr20250521174919846200000002-EqfMkZ"
      [32m+[0m[0m secret_string  = (sensitive value)
      [32m+[0m[0m version_id     = (known after apply)
      [32m+[0m[0m version_stage  = "AWSCURRENT"
      [32m+[0m[0m version_stages = (known after apply)
    }

[1m  # module.rds.aws_secretsmanager_secret_version.rds_secret_version_update["db"][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_secretsmanager_secret_version" "rds_secret_version_update" {
        id             = "arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-rds-sec-mgr20250521174919846200000002-EqfMkZ|terraform-20250521174920558600000010"
      [33m~[0m[0m version_stages = [
          [31m-[0m[0m "AWSPREVIOUS",
          [32m+[0m[0m "AWSCURRENT",
        ]
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # module.rds.module.rds_secret_rotate["db"].data.aws_caller_identity.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_caller_identity" "current" {
      [32m+[0m[0m account_id = (known after apply)
      [32m+[0m[0m arn        = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m user_id    = (known after apply)
    }

[1m  # module.rds.module.rds_secret_rotate["test"].data.aws_caller_identity.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_caller_identity" "current" {
      [32m+[0m[0m account_id = (known after apply)
      [32m+[0m[0m arn        = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m user_id    = (known after apply)
    }

[1m  # module.rds.module.lambda_rds.module.lambda.null_resource.archive[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "archive" {
      [33m~[0m[0m id       = "1107290844236829803" -> (known after apply)
      [33m~[0m[0m triggers = { [31m# forces replacement[0m[0m
          [33m~[0m[0m "timestamp" = "1748020159449569000" [33m->[0m[0m "1748021946061969000"
            [90m# (1 unchanged element hidden)[0m[0m
        }
    }

[1m  # module.rds.module.master[0].module.db_instance.aws_db_instance.this[0][0m must be [1m[31mreplaced[0m
[0m[32m+[0m/[31m-[0m[0m resource "aws_db_instance" "this" {
      [33m~[0m[0m address                               = "dex-backend-us-east-1-db-master.c23sic8syg8v.us-east-1.rds.amazonaws.com" -> (known after apply)
      [33m~[0m[0m arn                                   = "arn:aws:rds:us-east-1:986323537898:db:dex-backend-us-east-1-db-master" -> (known after apply)
      [33m~[0m[0m availability_zone                     = "us-east-1a" -> (known after apply)
      [33m~[0m[0m backup_target                         = "region" -> (known after apply)
      [33m~[0m[0m ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [31m-[0m[0m customer_owned_ip_enabled             = false [90m-> null[0m[0m
      [33m~[0m[0m database_insights_mode                = "standard" -> (known after apply)
      [31m-[0m[0m domain_dns_ips                        = [] [90m-> null[0m[0m
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [33m~[0m[0m endpoint                              = "dex-backend-us-east-1-db-master.c23sic8syg8v.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
      [33m~[0m[0m engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      [33m~[0m[0m engine_version_actual                 = "17.5" -> (known after apply)
      [33m~[0m[0m hosted_zone_id                        = "Z2R2ITUGPM61AM" -> (known after apply)
      [33m~[0m[0m id                                    = "db-JKPEU7NIEG5POWFH2WPLKRDGFM" -> (known after apply)
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [33m~[0m[0m iops                                  = 0 -> (known after apply)
      [33m~[0m[0m kms_key_id                            = "arn:aws:kms:us-east-1:986323537898:key/904b22c8-de4e-4331-a601-3ae1d81069d8" -> (known after apply)
      [33m~[0m[0m latest_restorable_time                = "2025-05-23T17:35:32Z" -> (known after apply)
      [33m~[0m[0m license_model                         = "postgresql-license" -> (known after apply)
      [33m~[0m[0m listener_endpoint                     = [] -> (known after apply)
      [33m~[0m[0m master_user_secret                    = [] -> (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [33m~[0m[0m network_type                          = "IPV4" -> (known after apply)
      [33m~[0m[0m option_group_name                     = "default:postgres-17" -> (known after apply)
      [33m~[0m[0m password                              = (sensitive value)
      [33m~[0m[0m performance_insights_kms_key_id       = "arn:aws:kms:us-east-1:986323537898:key/904b22c8-de4e-4331-a601-3ae1d81069d8" -> (known after apply)
      [32m+[0m[0m replica_mode                          = (known after apply)
      [33m~[0m[0m replicas                              = [] -> (known after apply)
      [33m~[0m[0m resource_id                           = "db-JKPEU7NIEG5POWFH2WPLKRDGFM" -> (known after apply)
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [33m~[0m[0m status                                = "available" -> (known after apply)
      [33m~[0m[0m storage_throughput                    = 0 -> (known after apply)
      [33m~[0m[0m storage_type                          = "gp2" -> (known after apply)
        tags                                  = {
            "Environment" = "dex-backend"
            "Owner"       = "dex-backend"
            "Terraform"   = "true"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      # [33mWarning[0m: this attribute value will no longer be marked as sensitive
      # after applying this change.[0m
      [33m~[0m[0m username                              = (sensitive value) [31m# forces replacement[0m[0m
        [90m# (32 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.rds.module.master[1].module.db_instance.aws_db_instance.this[0][0m must be [1m[31mreplaced[0m
[0m[32m+[0m/[31m-[0m[0m resource "aws_db_instance" "this" {
      [33m~[0m[0m address                               = "dex-backend-us-east-1-test-master.c23sic8syg8v.us-east-1.rds.amazonaws.com" -> (known after apply)
      [33m~[0m[0m arn                                   = "arn:aws:rds:us-east-1:986323537898:db:dex-backend-us-east-1-test-master" -> (known after apply)
      [33m~[0m[0m availability_zone                     = "us-east-1a" -> (known after apply)
      [33m~[0m[0m backup_target                         = "region" -> (known after apply)
      [33m~[0m[0m ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [31m-[0m[0m customer_owned_ip_enabled             = false [90m-> null[0m[0m
      [33m~[0m[0m database_insights_mode                = "standard" -> (known after apply)
      [31m-[0m[0m domain_dns_ips                        = [] [90m-> null[0m[0m
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [33m~[0m[0m endpoint                              = "dex-backend-us-east-1-test-master.c23sic8syg8v.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
      [33m~[0m[0m engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      [33m~[0m[0m engine_version_actual                 = "17.5" -> (known after apply)
      [33m~[0m[0m hosted_zone_id                        = "Z2R2ITUGPM61AM" -> (known after apply)
      [33m~[0m[0m id                                    = "db-CMQRP2BKP2IYZKLSYFEOAQW4QA" -> (known after apply)
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [33m~[0m[0m iops                                  = 0 -> (known after apply)
      [33m~[0m[0m kms_key_id                            = "arn:aws:kms:us-east-1:986323537898:key/904b22c8-de4e-4331-a601-3ae1d81069d8" -> (known after apply)
      [33m~[0m[0m latest_restorable_time                = "2025-05-23T17:35:53Z" -> (known after apply)
      [33m~[0m[0m license_model                         = "postgresql-license" -> (known after apply)
      [33m~[0m[0m listener_endpoint                     = [] -> (known after apply)
      [33m~[0m[0m master_user_secret                    = [] -> (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [33m~[0m[0m network_type                          = "IPV4" -> (known after apply)
      [33m~[0m[0m option_group_name                     = "default:postgres-17" -> (known after apply)
      [33m~[0m[0m password                              = (sensitive value)
      [33m~[0m[0m performance_insights_kms_key_id       = "arn:aws:kms:us-east-1:986323537898:key/904b22c8-de4e-4331-a601-3ae1d81069d8" -> (known after apply)
      [32m+[0m[0m replica_mode                          = (known after apply)
      [33m~[0m[0m replicas                              = [] -> (known after apply)
      [33m~[0m[0m resource_id                           = "db-CMQRP2BKP2IYZKLSYFEOAQW4QA" -> (known after apply)
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [33m~[0m[0m status                                = "available" -> (known after apply)
      [33m~[0m[0m storage_throughput                    = 0 -> (known after apply)
      [33m~[0m[0m storage_type                          = "gp2" -> (known after apply)
        tags                                  = {
            "Environment" = "dex-backend"
            "Owner"       = "dex-backend"
            "Terraform"   = "true"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      # [33mWarning[0m: this attribute value will no longer be marked as sensitive
      # after applying this change.[0m
      [33m~[0m[0m username                              = (sensitive value) [31m# forces replacement[0m[0m
        [90m# (32 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:DescribeSecret",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "AccountDescribe"
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:DescribeSecret",
              [32m+[0m[0m "secretsmanager:GetSecretValue",
              [32m+[0m[0m "secretsmanager:PutSecretValue",
              [32m+[0m[0m "secretsmanager:UpdateSecretVersionStage",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "LambdaReadWrite"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::986323537898:role/dex-backend-us-east-1-rds-lambda-secret-rotation",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # module.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.aws_secretsmanager_secret_policy.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_secretsmanager_secret_policy" "this" {
        id                  = "arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-db-rds-secret20250521174935468000000018-OmsWxw"
      [33m~[0m[0m policy              = jsonencode(
            {
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "secretsmanager:DescribeSecret"
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m AWS = "arn:aws:iam::986323537898:root"
                        }
                      [31m-[0m[0m Resource  = "*"
                      [31m-[0m[0m Sid       = "AccountDescribe"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = [
                          [31m-[0m[0m "secretsmanager:UpdateSecretVersionStage",
                          [31m-[0m[0m "secretsmanager:PutSecretValue",
                          [31m-[0m[0m "secretsmanager:GetSecretValue",
                          [31m-[0m[0m "secretsmanager:DescribeSecret",
                        ]
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m AWS = "arn:aws:iam::986323537898:role/dex-backend-us-east-1-rds-lambda-secret-rotation"
                        }
                      [31m-[0m[0m Resource  = "*"
                      [31m-[0m[0m Sid       = "LambdaReadWrite"
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) -> (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.aws_secretsmanager_secret_version.ignore_changes[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "ignore_changes" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = "arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-db-rds-secret20250521174935468000000018-OmsWxw"
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = (known after apply)
    }

[1m  # module.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:DescribeSecret",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "AccountDescribe"
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:DescribeSecret",
              [32m+[0m[0m "secretsmanager:GetSecretValue",
              [32m+[0m[0m "secretsmanager:PutSecretValue",
              [32m+[0m[0m "secretsmanager:UpdateSecretVersionStage",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "LambdaReadWrite"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::986323537898:role/dex-backend-us-east-1-rds-lambda-secret-rotation",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # module.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.aws_secretsmanager_secret_policy.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_secretsmanager_secret_policy" "this" {
        id                  = "arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-test-rds-secret20250521174935467900000016-rozutw"
      [33m~[0m[0m policy              = jsonencode(
            {
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "secretsmanager:DescribeSecret"
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m AWS = "arn:aws:iam::986323537898:root"
                        }
                      [31m-[0m[0m Resource  = "*"
                      [31m-[0m[0m Sid       = "AccountDescribe"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = [
                          [31m-[0m[0m "secretsmanager:UpdateSecretVersionStage",
                          [31m-[0m[0m "secretsmanager:PutSecretValue",
                          [31m-[0m[0m "secretsmanager:GetSecretValue",
                          [31m-[0m[0m "secretsmanager:DescribeSecret",
                        ]
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m AWS = "arn:aws:iam::986323537898:role/dex-backend-us-east-1-rds-lambda-secret-rotation"
                        }
                      [31m-[0m[0m Resource  = "*"
                      [31m-[0m[0m Sid       = "LambdaReadWrite"
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) -> (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.aws_secretsmanager_secret_version.ignore_changes[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "ignore_changes" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = "arn:aws:secretsmanager:us-east-1:986323537898:secret:dex-backend-us-east-1-test-rds-secret20250521174935467900000016-rozutw"
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = (known after apply)
    }

[1m  # module.rds.module.replica["db"].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "enhanced_monitoring" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions = [
              [32m+[0m[0m "sts:AssumeRole",
            ]

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "monitoring.rds.amazonaws.com",
                ]
              [32m+[0m[0m type        = "Service"
            }
        }
    }

[1m  # module.rds.module.replica["db"].module.db_instance.data.aws_partition.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_partition" "current" {
      [32m+[0m[0m dns_suffix         = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m partition          = (known after apply)
      [32m+[0m[0m reverse_dns_prefix = (known after apply)
    }

[1m  # module.rds.module.replica["db"].module.db_instance.aws_db_instance.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "this" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = (known after apply)
      [32m+[0m[0m allow_major_version_upgrade           = false
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = 0
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = "03:00-06:00"
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m database_insights_mode                = (known after apply)
      [32m+[0m[0m db_name                               = (known after apply)
      [32m+[0m[0m db_subnet_group_name                  = (known after apply)
      [32m+[0m[0m dedicated_log_volume                  = false
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m deletion_protection                   = false
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m enabled_cloudwatch_logs_exports       = [
          [32m+[0m[0m "postgresql",
          [32m+[0m[0m "upgrade",
        ]
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = (known after apply)
      [32m+[0m[0m engine_lifecycle_support              = (known after apply)
      [32m+[0m[0m engine_version                        = "17.5"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m iam_database_authentication_enabled   = false
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = "dex-backend-us-east-1-db-replica"
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.micro"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = "tue:00:00-tue:03:00"
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m max_allocated_storage                 = 0
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = false
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = "dex-backend-us-east-1-db-replica-20250523155945973800000002"
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = 5432
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m replicate_source_db                   = "dex-backend-us-east-1-db-master"
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_encrypted                     = false
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = (known after apply)
      [32m+[0m[0m vpc_security_group_ids                = [
          [32m+[0m[0m "sg-00a8f80582e9dfe97",
        ]

      [32m+[0m[0m timeouts {}
    }

[1mPlan:[0m 24 to add, 4 to change, 4 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @freelancedevsecops, Action: `pull_request`, Working Directory: `dex_backend`, Workflow: `Terraform Multi-Account Deployment`*